{"basics":{"name":"Yehya Farhat","email":"yehyafarhat [at] outlook [dot] com","language":"English, Arabic, French","profiles":[{"network":"Twitter","username":"yehyafarhat","url":"https://twitter.com/yehyafarhat"}]},"education":[{"institution":"Syracuse University","url":"https://www.syracuse.edu/","area":"Computer Science","studyType":"Master of Science","startDate":"2021","endDate":"2023","score":"3.64","courses":["Conducted independent research, composed and defended a thesis on End-to-End constrained optimization learning under the supervision of  <a href = 'https://nandofioretto.github.io/'>Prof. Ferdinando Fioreto</a>","GPA: 3.64"]},{"institution":"American University of Beirut (AUB)","url":"https://www.aub.edu.lb/","area":"Computer Science, Minor in Mathematics","studyType":"Bachelor of Science","startDate":"2016-08-01","endDate":"2020-12-01","score":"","courses":""}],"experience":[{"name":"Syracuse University EECS","position":"Research assistant","location":"Syracuse, NY","url":"https://ecs.syracuse.edu/academics/electrical-engineering-and-computer-science","startDate":"2022-08-01","endDate":"2023-05-14","summary":"","highlights":["Researched surrogate machine learning models for hard combinatorial optimization problems, worked on an amortized method for predict-and-optimize to achieve cutting-edge solutions with a 98% inference time speedup on small problem instances"]},{"name":"Qnovo","position":"Data Scientist","location":"Milpitas, CA","url":"https://www.qnovo.com/","startDate":"2022-06-01","endDate":"2022-08-29","highlights":["Operated as a full-stack engineer to design and build a battery testing platform and a corresponding user interface to query the database, reduced time spent on ad-hoc reporting from 2-3 days to 10 minutes","Cleaned and performed exploratory data analysis on 5M + rows of time-series data. Analysis was used to confirm the existence of a sensitivity problem in battery capacity estimates"]},{"name":"Syracuse University Colllege of Law","position":"IT Consultant","url":"https://law.syracuse.edu/","startDate":"2021-10-01","endDate":"2023-05-14","summary":"","highlights":["Imaged and connected new laptops and desktop devices to university servers, maintained and managed old devices. Setting up new kiosk machines using the university's updated imaging policies, successfully navigating server migration and replacing old kiosk desktops","Identified and resolved connectivity issues with all RoomWizard devices in the Law School by setting up and configuring a new proxy server, ensuring smooth and uninterrupted functionality"]},{"name":"Precast FZCO","position":"Software and Automatio Engineer","url":"https://precast-group.com/","startDate":"2021-04-01","endDate":"2021-07-14","summary":"","highlights":["Devised a cloud-based Microarchitecture; employed Microsoft azure to create a correspondence between CMMS software and the clients IOT software, streamlined task creation between software systems, reduced task creation time to zero","Designed and implemented an integration module to connect multiple ERP, IOT, and CMMS software, the module included an interface to allow clients to specify what information to streamline between softwares"]},{"name":"Syracuse Graduate Chess Club","position":"President and Co-Founder","url":"https://gradorg.syr.edu/student-orgs/grad-student-orgs/","startDate":"2022-02-01","endDate":"2023-05-01","summary":"","highlights":["Co-Founded the graduate chess club at Syracuse University, served the role of Acting President. orchestrating the club's growth, with over 150+ graduate participants during my tenure. Successfully facilitated a merger between the graduate and undergraduate chess clubs, fostering a cohesive and inclusive chess community within Syracuse University"]}],"volunteer":[],"awards":[],"certificates":[],"publications":[],"skills":[],"languages":[],"interests":[],"references":[],"projects":[]}